{
    "layers": [
        {
            "class_name": "Dense",
            "init_args": [
                10,
                784
            ],
            "weights_path": "models/mnist\\Dense0_weights.npy",
            "biases_path": "models/mnist\\Dense0_biases.npy"
        },
        {
            "class_name": "Softmax",
            "init_args": []
        }
    ],
    "loss_layer": {
        "class_name": "CrossEntropy",
        "init_args": []
    },
    "learing_rate": 0.01,
    "metrics": [
        "accuracy",
        "recall",
        "precision"
    ]
}