{
    "layers": [
        {
            "class_name": "Dense",
            "init_args": [
                2,
                10
            ],
            "weights_path": "models/circular3class\\Dense0_weights.npy",
            "biases_path": "models/circular3class\\Dense0_biases.npy"
        },
        {
            "class_name": "Sigmoid",
            "init_args": [
                10
            ]
        },
        {
            "class_name": "Dense",
            "init_args": [
                10,
                3
            ],
            "weights_path": "models/circular3class\\Dense2_weights.npy",
            "biases_path": "models/circular3class\\Dense2_biases.npy"
        },
        {
            "class_name": "Softmax",
            "init_args": [
                3
            ]
        }
    ],
    "loss_layer": {
        "class_name": "CrossEntropy",
        "init_args": [
            3
        ]
    },
    "learing_rate": 0.1,
    "metrics": [
        "accuracy",
        "recall",
        "precision"
    ]
}